{
  "مرحبا بكم في منصتنا": "Welcome to our platform",
  "هنا بامكانك التسجيل علي منصتنا لتقديم خدمة النقل للاخرين وجني ربح":"Here you can register on our platform to provide the transportation service to others and make a profit",
  "رس": "R.S",
  "تسجيل الدخول / التسجيل": "Login/Register",
  "ليموزين":"Limousine",
  "Driver":"Driver",
  "تسجيل الدخول للحساب":"Account login",
  "تسجيل الدخول":"Login",
  "من فضلك أدخل رقم صحيح":"Please enter a valid number",
  "انشاء حساب جديد":"Create a new account",
  "لكي تنضم الي عائلتنا لابد من امدادنا بالبيانات التي نحتاج لانشاء حساب جديد":"In order to join our family, you must provide us with the data that we need to create a new account.",
  "برجاء استخدام بيانات المعرفه مسبقا للدخول الي حسابك الموجود علي منصتنا":"Please use pre-defined data to log into your account on our platform",
  "استمرار":"continuation",
  "اكتب اسمك الاول فقط": "Type your first name only",
  "البريد الالكتروني": "e-mail",

  "من فضلك أدخل الاسم":"Please enter your name",
  "من فضلك أدخل البريد الالكترومي":"Please enter your e-mail",
  "رمز التحقق":"Verification Code",
  "ادخل رمز التحقق المرسل الي هاتفك الخلوي من اجل التحقيق":"Enter the verification code sent to your cell phone for the investigation",
  "لم يصلني كود ؟ برجاء ارسال كو اخر": "I did not receive a code? Please send another code",
  "مرحبا !": "Welcome !",
  "تسجيل ": "Login",

  "الدخول للحساب": "To Account",
  "ادخل رقم جوالك هنا": "Enter your phone",
  "ادخل": "Enter",
  " ادخل رمز التحقق المرسل الي هاتفك الخلوي من اجل التحقيق يظل الكود فعالا لمدة : ": "Enter the verification code sent to your cell phone for verification. The code remains valid for:",
  "ارسل كود اخر بديل": "Send another alternate code",
  "انشاء": "Create",
  "مرحبا بك في منصتنا ! من اجل انشاء حساب جديد لك كموفر لخدمة النقل اتبع الخطوات التالية": "Welcome to our platform! In order to create a new account for you as a transportation service provider, follow the following steps",
  "حساب جديد": "new Account",
  "بانشائك حساب جديد لدي منصتنا فان ذلك يعني انك قد وافقت علي الشروط و السياسات المتبعة لدي المنصة والتي تحترم القوانين المعمول بها في دول تقديم الخدمة": "By creating a new account with our platform, this means that you have agreed to the terms and policies of the platform, which respect the laws in force in the countries providing the service.",
  "انشاء حساب سائق": "Create a Driver Account",
  "برجاْء اكمال البيانات التالية": "Please complete the following data",
  "قم برفع صورة من صفحة البيانات الأساسية للجواز":  "Upload a photo from the basic data page of the passport",
  "قم برفع صورة من ترخيص السيارة الخاصة بك": "Upload a photo of your car license",
  "قم برفع صورة للسيارة ": "Upload a photo of the car",
  "الماركة": "Brand",
  "نوع السيارة": "Car Type",
  "الموديل": "Model",
  "الصنع": "Made",
  " شكرا لتسجيلك": "Thank you for your registration",
  "thanks":
  "We are happy to have you join our family. One of the members will review your request and contact you before we can approve your account .... It may take from one to four full working days. Be patient and everything will be fine."
}