import 'package:limousine_driver/core/utlis/strings.dart';

List<TypeTrip> typesTrip = [
  TypeTrip(
      id: 1,
      title: Strings.internal,
      desc: Strings.betweenRegions,
      icon: "assets/icons/city.svg"),
  TypeTrip(
      id: 2,
      title: Strings.externalString,
      desc: Strings.betweenCities,
      icon: "assets/icons/external.svg"),
  TypeTrip(
      id: 3,
      title: Strings.theSchool,
      desc: Strings.returnGo,
      icon: "assets/icons/school.svg"),
];

List<TypeTrip> addresses = [
  TypeTrip(
      id: 1,
      title: "شغلي",
      desc: "الرياض شارع ٤",
      icon: "assets/icons/work.svg"),
  TypeTrip(
      id: 2,
      title: "بيت امي",
      desc: "الشرقية ٧٧",
      icon: "assets/icons/home.svg"),
  TypeTrip(
      id: 3,
      title: "عمتي حنان",
      desc: "الشرقية ٧٧",
      icon: "assets/icons/school.svg"),
];

List<TypeTrip> badges = [
  TypeTrip(
      id: 1,
      title: Strings.badge1,
      desc: "الرياض شارع ٤",
      icon: "assets/images/badge1.png"),
  TypeTrip(
      id: 2,
      title: Strings.badge8,
      desc: "الشرقية ٧٧",
      icon: "assets/images/badge2.png"),
  TypeTrip(
      id: 3,
      title: Strings.badge2,
      desc: "الشرقية ٧٧",
      icon: "assets/images/badge3.png"),
  TypeTrip(
      id: 1,
      title: Strings.badge3,
      desc: "الرياض شارع ٤",
      icon: "assets/images/badge4.png"),
  TypeTrip(
      id: 2,
      title: Strings.badge4,
      desc: "الشرقية ٧٧",
      icon: "assets/images/badge5.png"),
  TypeTrip(
      id: 3,
      title: Strings.badge5,
      desc: "الشرقية ٧٧",
      icon: "assets/images/badge6.png"),
  TypeTrip(
      id: 1,
      title: Strings.badge6,
      desc: "الرياض شارع ٤",
      icon: "assets/images/badge7.png"),
  TypeTrip(
      id: 2,
      title: Strings.badge7,
      desc: "الشرقية ٧٧",
      icon: "assets/images/badge9.png"),
];

class TypeTrip {
  final int id;
  final String title;
  final String desc;
  final String icon;

  TypeTrip(
      {required this.id,
      required this.title,
      required this.desc,
      required this.icon});
}

List<CarBrand> carsBrands = [
  CarBrand(id: 1, title: "ملاكس"),
  CarBrand(id: 1, title: "مرسيدس"),
  CarBrand(id: 1, title: "جيب")
];

List<CarBrand> carTypes = [
  CarBrand(id: 1, title: "typ1"),
  CarBrand(id: 1, title: "typ2"),
  CarBrand(id: 1, title: "typ3")
];
List<CarBrand> carModels = [
  CarBrand(id: 1, title: "model1"),
  CarBrand(id: 1, title: "model2"),
  CarBrand(id: 1, title: "model3")
];

List<CarBrand> carMade = [
  CarBrand(id: 1, title: "2020"),
  CarBrand(id: 1, title: "2021"),
  CarBrand(id: 1, title: "2022")
];

class CarBrand {
  final int id;
  final String title;
  CarBrand({required this.id, required this.title});
}

const String policy =
    " و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات  سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانا و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات  سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانا و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات  سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانا و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات  سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانا و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات  سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانا و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات  سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانا و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات  سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانا و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات  سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانا و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات  سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانا و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات  سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانا و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات  سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانا سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات  سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات سياسات الاستخدام و الخصوصية و مشاركة البيانات";
//  و، و، و، و، و ،  و ، و، و، وجيزان، ونجران، والباحة، وسكاك

List<String> cities = [
  "الرياض",
   "مكة",
    "المدينة المنورة",
    "بريدة",
   "الدمام",
    "أبها",
    "تبوك",
   "حائل",
    "عرعر"
    ];
